In [16]:
import os
import pandas as pd
csv_path = os.path.join("./", "mine.csv")
print(csv_path)
mine = pd.read_csv(csv_path)
print(mine)

./mine.csv
      name   gender  age  weight
0     John     male   30     180
1     mary   female   30     170
2     alex     male   10      90
3    alice   female    9      85
4    grace   female   15     120
5      jim     male   13     150
6  grandpa     male   60     190
7  grandma   female   60     200

In [3]:
mine.head()

    name   gender   age   weight
0   John     male    30      180
1   mary   female    30      170
2   alex     male    10       90
3  alice   female     9       85
4  grace   female    15      120

In [5]:
mine.head(100)

      name   gender   age   weight
0     John     male    30      180
1     mary   female    30      170
2     alex     male    10       90
3    alice   female     9       85
4    grace   female    15      120
5      jim     male    13      150
6  grandpa     male    60      190
7  grandma   female    60      200

In [11]:
mine["name"]

0       John
1       mary
2       alex
3      alice
4      grace
5        jim
6    grandpa
7    grandma
Name: name, dtype: object

In [17]:
mine["age"]

0    30
1    30
2    10
3     9
4    15
5    13
6    60
7    60
Name: age, dtype: int64

In [15]:
mine.describe()

             age      weight
count   8.000000    8.000000
mean   28.375000  148.125000
std    21.158838   44.875821
min     9.000000   85.000000
25%    12.250000  112.500000
50%    22.500000  160.000000
75%    37.500000  182.500000
max    60.000000  200.000000

In [8]:
csv_path = os.path.join("./", "linear.csv")
line = pd.read_csv(csv_path)

In [9]:
line

    x   y   above
0  10   9       0
1   9  10       1
2   9   9       1
3  10  10       1
4   1   1       1
5   1   2       1
6   2   1       0

In [10]:
len(line)

7

In [11]:
len(mine)

8